app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT `comments`.* FROM `comments`

  def show
    @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`content`, `created_at`, `post_id`, `updated_at`, `user_name`) VALUES ('Nice post', '2013-11-29 04:39:59', 1, '2013-11-29 04:39:59', 'Amit')

  def load_objects
    @post = Post.where(id: params[:post_id]).first
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1