app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def show
    @post = Post.find(params[:id])

INSERT INTO `posts` (`content`, `created_at`, `title`, `updated_at`) VALUES ('Hello World,\r\nThis is my first blog :-)', '2013-11-29 04:17:15', 'Hello World', '2013-11-29 04:17:15')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def recent_comments
    @post = Post.find(params[:id])